owhinata/stm32f746g-disco/port/camera/camera.c
/*
 * SPDX-License-Identifier: MIT
 * Copyright (c) 2026 ThreadX Shell Project
 */
/**
 * @file    camera.c
 * @brief   B-CAMS-OMV (OV5640) camera driver: power + I2C probe (#39),
 *          DCMI + DMA snapshot capture (#41).
 *
 * See camera.h for the API contract and the hardware facts.  Setup:
 *
 *   - I2C1 on PB8 (SCL) / PB9 (SDA), AF4 open-drain.  The OV5640 SCCB bus runs
 *     at ~100 kHz standard mode; TIMINGR is computed for PCLK1 = 54 MHz (the
 *     ST BSP constant 0x40912732 assumes 50 MHz and would land at ~118 kHz).
 *   - PWR_EN on PH13, LOW = camera powered (ST BSP semantics: the pin is the
 *     module's POWER_DOWN, active high).  It is parked HIGH (off) before the
 *     pin is switched to output so the module never sees a power glitch.
 *   - The OV5640 component driver (lib/ov5640) does all sensor register I/O
 *     through the OV5640_IO_t bus glue below: HAL_I2C_Mem_* with 16-bit
 *     register addresses at I2C address 0x78.
 *   - DCMI (issue #41): 8-bit parallel, hardware sync, HSYNC=HIGH /
 *     VSYNC=HIGH / PCLK=RISING -- the H747I-DISCO BSP's proven OV5640 values;
 *     OV5640_Init() programs the matching sensor-side polarities.  Pins
 *     (F746G-DISCO P1, all AF13): PA4=HSYNC, PA6=PIXCLK, PG9=VSYNC,
 *     PH9..PH12,PH14=D0..D4, PD3=D5, PE5=D6, PE6=D7.
 *   - DMA2 Stream1/Ch1 (RM0385 Table 26; SD owns Stream3/6), single-shot
 *     DMA_NORMAL: one QVGA RGB565 frame = 153600 B = 38400 words fits one
 *     NDTR (<= 65535), so HAL_DCMI_Start_DMA runs a plain single transfer.
 *
 * Completion model (HAL): when the DMA finishes the frame's words,
 * DCMI_DMAXferCplt arms the DCMI FRAME interrupt; the FRAME ISR then calls
 * HAL_DCMI_FrameEventCallback -> tx_semaphore_put.  Sync/overrun errors and
 * DMA errors all funnel into HAL_DCMI_ErrorCallback.  Same drain/active-gate
 * discipline as the SD driver (port/sd/sd_card.c).
 *
 * Cache coherency: none needed -- the frame buffer lives in the .sdram
 * section, which bsp_init() maps Normal non-cacheable through the MPU
 * (issue #40), so the DMA writes and CPU reads are coherent by construction.
 *
 * Clean-room glue; the ST BSP (stm32746g_discovery_camera.c, H747I BSP) and
 * RM0385/UM1907/UM2779 were used as a register/pin/timing reference only.
 */
#include "camera.h"
#include "sdram.h"

#include "stm32f7xx_hal.h"
#include "tx_api.h"

#include <string.h>

#include "ov5640.h"

#include "frame.h"
#include "frame_pipeline.h"

#define LOG_TAG "camera"
#include "log.h"

/* PWR_EN = PH13 (UM1907 Table 13: DCMI_PWR_EN).  LOW = powered. */
#define CAM_PWR_PORT GPIOH
#define CAM_PWR_PIN  GPIO_PIN_13

/* OV5640 SCCB write address (B-CAMS-OMV MB1379; H747I BSP CAMERA_OV5640_ADDRESS). */
#define CAM_I2C_ADDR 0x78u

/* Per-register I2C transaction ceiling.  SCCB ops are 3-4 bytes; 100 ms only
   ever matters when the bus is wedged. */
#define CAM_I2C_TIMEOUT_MS 100u

/*
 * I2C1 TIMINGR for 100 kHz standard mode at I2CCLK = PCLK1 = 54 MHz
 * (RM0385 30.4.10 / 30.7.5, tI2CCLK = 18.52 ns):
 *
 *   PRESC  = 11 -> tPRESC = 12 x 18.52 ns = 222.2 ns
 *   SCLL   = 24 -> tLOW  = 25 x 222.2 ns = 5.56 us  (>= 4.7 us SM minimum)
 *   SCLH   = 19 -> tHIGH = 20 x 222.2 ns = 4.44 us  (>= 4.0 us SM minimum)
 *   SCLDEL =  5 -> data setup  6 x 222.2 ns = 1.33 us (>= tr 1.0 us + tSU;DAT 0.25 us)
 *   SDADEL =  2 -> data hold   2 x 222.2 ns = 0.44 us (within 0 .. tHD;DAT max)
 *
 *   SCL ~= 1 / (5.56 us + 4.44 us + sync) ~= 99 kHz
 */
#define CAM_I2C_TIMING ((11u << 28) | (5u << 20) | (2u << 16) | (19u << 8) | 24u)

/* Settle times (ThreadX ticks = ms).  AEC/AWB needs a few frames after the
   big OV5640_Init register load; a mode switch (live <-> colorbar) needs a
   frame or two to propagate through the pipeline. */
#define CAM_SETTLE_INIT_MS  300u
#define CAM_SETTLE_MODE_MS  100u

/* One QVGA frame at any plausible OV5640 frame rate is well under 1 s. */
#define CAM_XFER_TIMEOUT_TICKS 1000u

/*
 * SDE_CTRL0 (0x5580) -- the Special-Digital-Effects master enable register
 * (OV5640 datasheet table 7-26).  Each lib/ov5640 quality setter *overwrites*
 * this register with only its own enable bit, so applying brightness then
 * saturation leaves just the saturation bit set and brightness silently dies.
 * The fixup in settings_apply_all_locked() OR-s the right bits back together.
 *   b7 Fixed Y  b6 Negative  b5 Gray  b4 Fixed V  b3 Fixed U
 *   b2 Contrast (shared by brightness: it rides the contrast Y-bright path)
 *   b1 Saturation  b0 Hue
 */
#define OV5640_REG_SDE_CTRL0  0x5580u
#define SDE0_HUE_EN       0x01u
#define SDE0_SAT_EN       0x02u
#define SDE0_CONTRAST_EN  0x04u   /* brightness + contrast (both Y path)    */
#define SDE0_FIXED_U_EN   0x08u
#define SDE0_FIXED_V_EN   0x10u
#define SDE0_NEG_EN       0x40u
#define SDE0_TINT         (SDE0_FIXED_U_EN | SDE0_FIXED_V_EN)  /* 0x18      */
/* Bits this driver owns; bits we never touch (b5 Gray, b7 Fixed Y) are kept. */
#define SDE0_MANAGED      (SDE0_NEG_EN | SDE0_TINT | SDE0_CONTRAST_EN | \
                           SDE0_SAT_EN | SDE0_HUE_EN)          /* 0x5F      */

/*
 * SDE_CTRL8 (0x5588) carries the sign / UV-adjust-manual-enable bits the
 * brightness/contrast/saturation/hue setters poke via the vendored
 * ov5640_modify_reg -- which is OR-only (ov5640.c: TempData1 |= data & mask)
 * and so can SET but never CLEAR a masked bit.  Worse, the setters' masks
 * overlap on bit0: contrast/saturation force it (mask 0x41) while hue owns it
 * (mask 0x33), so OR-only leaves bit0 stuck for hue degrees whose table entry
 * lacks it (e.g. -180 deg wants 0x32 but ends 0x33).  Rather than fight the
 * OR-only helper, settings_apply_all_locked() rewrites the managed bits of
 * SDE_CTRL8 with an EXACT value computed from the cache after the setters run.
 *   b6 UV-adjust-manual-enable (the contrast/saturation path needs it)
 *   b3 Y-bright sign for contrast (set when brightness < 0)
 *   b5 b4 b1 b0 hue sin/cos sign bits (from the OV5640 hue table)
 */
#define OV5640_REG_SDE_CTRL8  0x5588u
#define SDE8_UV_MANUAL    0x40u
#define SDE8_YBRIGHT_SIGN 0x08u
#define SDE8_HUE_SIGNS    0x33u
#define SDE8_MANAGED      (SDE8_UV_MANUAL | SDE8_YBRIGHT_SIGN | SDE8_HUE_SIGNS)
                                                              /* 0x7B */

static I2C_HandleTypeDef hcam_i2c;     /* I2C1, SCCB to the OV5640      */
static DCMI_HandleTypeDef hdcmi;       /* DCMI, 8-bit parallel capture  */
static DMA_HandleTypeDef hdma_dcmi;    /* DMA2 Stream1/Ch1: DCMI -> mem */
static OV5640_Object_t   ov5640;

static TX_MUTEX     cam_lock;          /* per-operation serialization        */
static TX_SEMAPHORE cam_done;          /* count 0; ISR posts frame complete  */
static volatile int cam_xfer_err;      /* set by HAL_DCMI_ErrorCallback      */
static volatile int cam_xfer_active;   /* 1 between DMA issue and completion */

static int cam_ready;                  /* camera_init() done           */
static int cam_colorbar = -1;          /* last pattern mode; -1 unknown */
static uint32_t cam_frame_gen;         /* bumped per successful capture */
static struct camera_info info;

/* Quality settings (issue #44): RAM cache, all neutral by default.  Survives
   power cycles so a `camera set` made while powered off still takes effect at
   the next capture; cleared back to these defaults only by camera_set_defaults. */
static struct camera_settings settings = {
	.brightness = 0, .contrast = 0, .saturation = 0, .hue = 0,
	.awb        = CAM_AWB_AUTO, .effect = CAM_FX_NONE,
	.flip       = CAM_FLIP_NONE, .zoom = 1, .night = 0,
};
/* Set whenever the cache changes; cleared only after a successful apply.  Lets
   a live capture re-apply when a previous immediate apply failed (I2C glitch),
   so the cache and the sensor never silently diverge. */
static int settings_dirty;

/* ---- capture mode: resolution / pixel format / fps (issue #45) ----------- */
/*
 * The single source of truth for the live capture geometry/format/timing.  The
 * snapshot/stream paths read it instead of the old fixed CAMERA_FRAME_* macros;
 * camera_set_format() re-programs the sensor and updates it.  Defaults to the
 * power-on QVGA RGB565 mode so the driver behaves exactly as before #45 until a
 * mode switch.  Timing (hts/vts/pclk) is the OV5640 common-table reality at
 * power-on; the fps table (mode_fps[]) overrides it on a set_format. */
static struct camera_mode mode = {
	.res = CAM_RES_QVGA, .format = CAM_FMT_RGB565,
	.hts = 1600u, .vts = 1000u, .pclk_hz = 24000000u,   /* QVGA fps-table base */
};

/* Pure geometry per resolution (independent of format/timing). */
static const uint16_t res_wh[CAM_RES__COUNT][2] = {
	{ 160u, 120u },   /* QQVGA   */
	{ 320u, 240u },   /* QVGA    */
	{ 480u, 272u },   /* 480x272 */
	{ 640u, 480u },   /* VGA     */
	{ 800u, 480u },   /* WVGA    */
};

/* JPEG single-shot capture budget: <= 65535 words so HAL_DCMI_Start_DMA runs a
   plain (non-banded) DMA and the valid length is simply budget - NDTR (#45). */
#define CAM_JPEG_BUDGET_WORDS  65535u
#define CAM_JPEG_BUDGET_BYTES  (CAM_JPEG_BUDGET_WORDS * 4u)

static uint32_t fmt_bytes_per_pixel(uint8_t fmt)
{
	switch (fmt) {
	case CAM_FMT_RGB565:
	case CAM_FMT_YUV422: return 2u;
	case CAM_FMT_Y8:     return 1u;
	default:             return 0u;   /* JPEG: variable */
	}
}

/* Recompute the geometry-derived fields after a res/format change.  Timing
   (hts/vts/pclk_hz) is set separately from the fps table; fps_target_x10 is the
   theoretical target pclk/(hts*vts), not a measured rate. */
static void mode_recompute(struct camera_mode *m)
{
	m->width  = res_wh[m->res][0];
	m->height = res_wh[m->res][1];
	m->is_jpeg = (m->format == CAM_FMT_JPEG) ? 1u : 0u;
	m->bytes_per_pixel = (uint8_t)fmt_bytes_per_pixel(m->format);
	if (m->is_jpeg) {
		m->frame_bytes = CAM_JPEG_BUDGET_BYTES;
		m->frame_words = CAM_JPEG_BUDGET_WORDS;
		m->streamable  = 0u;        /* JPEG is snapshot-only */
	} else {
		/* All supported (even-width, even-height) raster modes give a frame_bytes
		   that is a multiple of 4, so frame_words = frame_bytes/4 is exact and the
		   HAL banding splits evenly -- keep that invariant if a mode is added. */
		m->frame_bytes = (uint32_t)m->width * m->height * m->bytes_per_pixel;
		m->frame_words = m->frame_bytes / 4u;
		m->streamable  = (m->frame_words <= 65535u) ? 1u : 0u;
	}
	if (m->hts != 0u && m->vts != 0u)
		m->fps_target_x10 = (uint16_t)((uint64_t)m->pclk_hz * 10u /
		                               ((uint32_t)m->hts * m->vts));
	else
		m->fps_target_x10 = 0u;
}

/* Largest fixed-format snapshot frame = WVGA RGB565 (800x480x2).  cam_frame is
   sized for it (one contiguous region, required by the HAL intra-frame banding)
   and also serves as the JPEG capture budget buffer (<= CAM_JPEG_BUDGET_BYTES).
   The active mode uses a prefix; the rest is unused slack (#45). */
#define CAM_FRAME_MAX_BYTES  (800u * 480u * 2u)   /* 768000, 32-aligned */

/* Snapshot frame buffer in external SDRAM (.sdram: NOLOAD, MPU non-cacheable,
   #40).  DMA-written by DCMI, CPU-read by camera_frame_read -- coherent with no
   cache maintenance because the region never allocates cache lines. */
static uint8_t cam_frame[CAM_FRAME_MAX_BYTES]
	__attribute__((aligned(32), section(".sdram")));

/* ---- streaming (issue #46): DCMI continuous + DMA double-buffer ---------- */
/*
 * The continuous producer feeds a frame pipeline (svc/frame_pipeline.c, the #47
 * design).  N ring slots live in .sdram next to cam_frame[]: at any instant the
 * DMA double-buffer (DBM) targets two of them (M0AR/M1AR), one holds the latest
 * published frame, and one is free to be acquired -- so N=4.  On each frame the
 * dedicated cam_producer thread (NOT an ISR, NOT the shell thread) reads CT to
 * find the just-completed buffer, acquires a free slot, repoints that buffer's
 * M-register away (HAL_DMAEx_ChangeMemory) and only THEN publishes -- so a slot
 * handed to a sink is never a live DMA target (tear-free).  The DMA TC ISR only
 * posts cam_stream_sem.  Streaming and the snapshot path share hdcmi/hdma_dcmi
 * and are mutually exclusive (cam_stream_active gate).
 */
#define CAM_RING_N         4u      /* 2 DBM targets + 1 latest + 1 free        */
#define CAM_PRODUCER_PRIO  10u     /* below IWDG petter (5), like LED (10)      */
#define CAM_PRODUCER_STACK 2048u
#define CAM_PRODUCER_TICK  10u     /* bounded sem wait so --secs/stop fire even
                                      when no frames arrive (sync lost), ms      */

/* Ring slot stride = the largest *streamable* frame (frame_words <= 65535, i.e.
   <= 262140 B): 480x272 RGB565 = 261120 B is the largest, rounded up to 256 KB.
   Streaming is gated to modes that fit this (stream_start_locked); snapshot of
   bigger modes uses cam_frame, not the ring.  Ring = 4 x 256 KB = 1 MB (#45). */
#define CAM_RING_SLOT_CAP  (256u * 1024u)         /* 262144, >= 480x272 RGB565 */

static uint8_t cam_ring[CAM_RING_N][CAM_RING_SLOT_CAP]
	__attribute__((aligned(32), section(".sdram")));

static struct frame_pipeline cam_pipe;
static TX_MUTEX     cam_pipe_lock;        /* frame_os mutex for the pipeline    */
static TX_SEMAPHORE cam_stream_sem;       /* DMA TC ISR -> producer (completions) */
static TX_SEMAPHORE cam_start_sem;        /* start -> producer idle wakeup       */
static TX_THREAD    cam_producer;
static UCHAR        cam_producer_stack[CAM_PRODUCER_STACK];
static struct frame_sink cam_stat_sink;   /* counting sink (FPS / OVR source)   */
static struct frame_sink *cam_ext_sink;   /* GUIX live-preview sink (#56), owner;
                                             NULL = no preview (cam_lock-guarded) */

