owhinata/stm32f746g-disco/port/camera/camera.c
/* Apply the cached quality settings AND refresh the exposure-aware VTS in one
   shot: every settings application can change night mode, which raises the AEC
   max exposure, so the VTS clamp must run right after (otherwise a live `camera
   set night on` starves the auto-exposure at the fps-table VTS).  Caller holds
   cam_lock with the sensor configured and the mode committed. */
static int settings_and_timing_apply_locked(void)
{
	int rc = settings_apply_all_locked();   /* clears settings_dirty on success */

	if (rc != 0)
		return rc;
	rc = apply_vts_locked();
	if (rc != 0)
		settings_dirty = 1;   /* SDE applied but timing not: re-arm so the next
		                         configure re-applies settings AND re-clamps VTS,
		                         keeping the night-mode AEC / VTS pairing intact */
	return rc;
}

/* Apply now if the sensor is live; otherwise the cache is enough.  Cache-only
   when not configured (the next capture's lazy configure re-applies it after
   OV5640_Init wipes the SDE block) or while the colorbar test pattern is up
   (returning to live re-applies, and we must not disturb its SDE_CTRL4). */
static int apply_if_live_locked(void)
{
	if (!info.configured || cam_colorbar != 0)
		return 0;
	return settings_and_timing_apply_locked();
}

/* ---- capture (locked helpers, issue #41) ---------------------------------- */

/* Remove any leftover signals so a stale post cannot satisfy the next wait. */
static void drain_done(void)
{
	while (tx_semaphore_get(&cam_done, TX_NO_WAIT) == TX_SUCCESS)
		;
}

/* Program the sensor for QVGA RGB565 (once after each power-up) and select
   the live / colorbar source.  Both paths sleep so AEC/AWB or the pattern
   switch settles before the snapshot. */
static int camera_configure_locked(int colorbar)
{
	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565)
		    != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			return CAM_ERR_HAL;
		}
		info.configured = 1;
		cam_colorbar    = -1;   /* forces the mode block below to run */
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (cam_colorbar != colorbar) {
		if (OV5640_ColorbarModeConfig(&ov5640,
		                              colorbar ? COLORBAR_MODE_ENABLE
		                                       : COLORBAR_MODE_DISABLE)
		    != OV5640_OK) {
			LOG_ERR("OV5640 colorbar config failed");
			return CAM_ERR_HAL;
		}
		tx_thread_sleep(CAM_SETTLE_MODE_MS);

		/* Re-apply the cached quality settings LAST, in live mode only:
		   OV5640_Init and ColorbarModeConfig(DISABLE) both write the SDE
		   register block (the latter sets SDE_CTRL4), so the settings must
		   land after them or they get clobbered (issue #44).  The colorbar
		   test pattern owns its own SDE_CTRL4 and ignores quality, so skip
		   it there.  cam_colorbar is committed only after a successful apply
		   so a failed apply re-runs this block on the next capture. */
		if (!colorbar) {
			int rc = settings_and_timing_apply_locked();

			if (rc != 0)
				return rc;
		}
		cam_colorbar = colorbar;
	}

	/* Mode unchanged but a prior live apply failed (settings_dirty): retry so
	   the sensor matches the cache.  Skipped in colorbar mode -- quality is
	   irrelevant there and would disturb the test pattern's SDE_CTRL4. */
	if (!colorbar && settings_dirty) {
		int rc = settings_and_timing_apply_locked();

		if (rc != 0)
			return rc;
	}
	return 0;
}

/* ---- mode switch: resolution / pixel format / fps (issue #45) ------------- */

/*
 * Per-resolution fps table.  fps = pclk_hz / (hts * vts).  ALL modes stay on the
 * common-table 24 MHz PCLK: pushing PCLK to 48 MHz (for ~30 fps) doubles the
 * peak DCMI burst rate and overruns the 16-bit SDRAM the instant the LTDC also
 * reads it (the GUIX preview dies with a DCMI overrun) -- that bandwidth fight is
 * issue #59.  Here we only tighten HTS/VTS on the streamable small modes for a
 * safe ~15 fps (same peak rate as the proven 11 fps preview, just less blanking);
 * VGA/WVGA keep the full common timing (snapshot-only, frame rate irrelevant).
 * VTS is the BASE: apply_vts_locked() raises the effective VTS when the AEC max
 * exposure needs more lines and drops it back to this base otherwise.  Tune
 * against on-hardware `camera stream stats` (30 fps belongs to #59).
 */
static const struct {
	uint16_t hts;
	uint16_t vts;
	uint8_t  ov_pclk;     /* OV5640_PCLK_* */
	uint32_t pclk_hz;
} mode_fps[CAM_RES__COUNT] = {
	[CAM_RES_QQVGA]   = { 1600u, 1000u, OV5640_PCLK_24M, 24000000u },
	[CAM_RES_QVGA]    = { 1600u, 1000u, OV5640_PCLK_24M, 24000000u },
	[CAM_RES_480x272] = { 1600u, 1000u, OV5640_PCLK_24M, 24000000u },
	[CAM_RES_VGA]     = { 1936u, 1088u, OV5640_PCLK_24M, 24000000u },
	[CAM_RES_WVGA]    = { 1936u, 1088u, OV5640_PCLK_24M, 24000000u },
};

static uint32_t res_to_ov(uint8_t r)
{
	switch (r) {
	case CAM_RES_QQVGA:   return OV5640_R160x120;
	case CAM_RES_480x272: return OV5640_R480x272;
	case CAM_RES_VGA:     return OV5640_R640x480;
	case CAM_RES_WVGA:    return OV5640_R800x480;
	default:              return OV5640_R320x240;   /* QVGA */
	}
}

static uint32_t fmt_to_ov(uint8_t f)
{
	switch (f) {
	case CAM_FMT_YUV422: return OV5640_YUV422;
	case CAM_FMT_Y8:     return OV5640_Y8;
	case CAM_FMT_JPEG:   return OV5640_JPEG;
	default:             return OV5640_RGB565;
	}
}

/* Map the port-neutral format to the pipeline's frame_format (for publish). */
static enum frame_format fmt_to_frame(uint8_t f)
{
	switch (f) {
	case CAM_FMT_YUV422: return FRAME_FMT_YUV422;
	case CAM_FMT_Y8:     return FRAME_FMT_Y8;
	case CAM_FMT_JPEG:   return FRAME_FMT_JPEG;
	default:             return FRAME_FMT_RGB565;
	}
}

/*
 * Switch the live resolution / pixel format and apply the per-mode fps timing.
 * Refused while streaming/preview owns the DCMI (the ring is a live target).
 * On any I/O failure the sensor is marked unconfigured and the mode is reset to
 * the QVGA RGB565 default, so a half-applied sensor/DCMI state never persists --
 * the next capture full-re-inits to a state that matches the descriptor (#45).
 * cam_lock held by the caller.
 */
static int camera_set_format_locked(uint8_t res, uint8_t fmt)
{
	struct camera_mode m;
	int jpeg = (fmt == CAM_FMT_JPEG);
	int rc;

	if (cam_stream_active || cam_ext_sink != NULL)
		return CAM_ERR_STATE;          /* streaming/preview owns the DCMI/DMA */
	if (!sdram_is_up())
		return CAM_ERR_STATE;
	if (res >= CAM_RES__COUNT || fmt >= CAM_FMT__COUNT)
		return CAM_ERR_PARAM;
	if (jpeg && res > CAM_RES_VGA)
		return CAM_ERR_PARAM;          /* JPEG is snapshot-only, gated <= VGA */

	/* Candidate mode: geometry from res + timing from the fps table.  Validate
	   capacity before touching the sensor. */
	m = (struct camera_mode){ .res = res, .format = fmt,
	    .hts = mode_fps[res].hts, .vts = mode_fps[res].vts,
	    .pclk_hz = mode_fps[res].pclk_hz };
	mode_recompute(&m);
	if (m.frame_bytes > CAM_FRAME_MAX_BYTES)
		return CAM_ERR_PARAM;

	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}

