owhinata/stm32f746g-disco/port/camera/camera.c
	/* A JPEG <-> raster change cannot be applied incrementally: the lib's
	   OV5640_SetPixelFormat SETS the JPEG datapath bits (TIMING_TC_REG21 /
	   SYSREM_RESET02 / CLOCK_ENABLE02) but never clears them, so a raster capture
	   after a JPEG one wedges (no sync -> timeout).  Force a clean sensor re-init:
	   clearing IsInitialized lets OV5640_Init re-run the common table, whose first
	   write is a software reset (SYSTEM_CTROL0=0x82) that restores those bits.
	   Toggle the DCMI JPEGMode to match. */
	if (jpeg != (int)mode.is_jpeg) {
		ov5640.IsInitialized = 0U;
		info.configured = 0;
		if (dcmi_set_jpeg(jpeg) != 0) {
			LOG_ERR("DCMI JPEG re-init failed");
			goto fail;
		}
	}

	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565) != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			goto fail;
		}
		info.configured = 1;
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (OV5640_SetResolution(&ov5640, res_to_ov(res)) != OV5640_OK)
		goto fail;
	if (OV5640_SetPixelFormat(&ov5640, fmt_to_ov(fmt)) != OV5640_OK)
		goto fail;
	if (OV5640_SetPCLK(&ov5640, mode_fps[res].ov_pclk) != OV5640_OK)
		goto fail;

	/* Commit the base mode now: the quality re-apply + timing below needs the
	   committed mode (ZoomConfig reads the new DVPHO/DVPVO, night mode rewrites
	   AEC, and apply_vts writes the effective VTS from mode.hts/vts).  A failure
	   after this lands in the fail path, which resets to the default. */
	mode = m;
	rc = settings_and_timing_apply_locked();   /* SDE settings + HTS/VTS clamp */
	if (rc != 0)
		goto fail;

	info.frame_valid = 0;              /* geometry changed: old frame is stale */
	info.frame_bytes = 0;
	cam_colorbar     = -1;             /* next capture re-establishes live/colorbar */
	tx_thread_sleep(CAM_SETTLE_MODE_MS);
	return 0;

fail:
	/* Consistent fallback: mode + DCMI reset to the QVGA RGB565 default and the
	   sensor flagged for re-init, so a half-applied sensor/DCMI/mode state never
	   persists -- the next capture re-programs to a state matching the descriptor. */
	info.configured  = 0;
	info.frame_valid = 0;
	info.frame_bytes = 0;
	cam_colorbar     = -1;
	mode_reset_default();
	LOG_ERR("camera_set_format(res=%u fmt=%u) failed", (unsigned)res,
	        (unsigned)fmt);
	return CAM_ERR_HAL;
}

/* Rebuild the DMA stream after an aborted snapshot.  A VGA/WVGA snapshot runs
   the HAL intra-frame banding path, which sets CR.DBM; a normal completion
   self-heals (the next Start clears or re-sets DBM as needed), but an aborted
   banded transfer (timeout / DCMI error) can leave DBM/CT stale, so re-init the
   stream to a clean DMA_NORMAL state for the next capture (#45 R8). */
static void snapshot_dma_reinit(void)
{
	(void)HAL_DMA_DeInit(&hdma_dcmi);
	(void)HAL_DMA_Init(&hdma_dcmi);
	__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
}

/* Determine the valid length of a JPEG snapshot.  @p eff_bytes is how many bytes
   the DMA actually wrote (budget - NDTR, in bytes); the real stream is shorter
   because the DCMI zero-pads the last 32-bit word.  Verify the SOI (0xFFD8) at
   the start and scan backward within eff_bytes for the EOI marker (0xFFD9),
   setting info.frame_bytes to EOI+2.  No EOI -> the frame was truncated.  Only
   the captured range is scanned (the .sdram buffer is NOLOAD: it can hold an
   older/garbage tail beyond eff_bytes). */
static int jpeg_finalize_locked(uint32_t eff_bytes)
{
	uint32_t i;

	if (eff_bytes < 4u ||
	    cam_frame[0] != 0xFFu || cam_frame[1] != 0xD8u) {
		LOG_ERR("JPEG SOI missing (eff=%lu)", (unsigned long)eff_bytes);
		return CAM_ERR_HAL;
	}
	for (i = eff_bytes; i >= 2u; i--) {
		if (cam_frame[i - 2u] == 0xFFu && cam_frame[i - 1u] == 0xD9u) {
			info.frame_bytes = i;          /* include the EOI marker */
			return 0;
		}
	}
	LOG_ERR("JPEG EOI missing (truncated, eff=%lu)", (unsigned long)eff_bytes);
	return CAM_ERR_HAL;
}

static int camera_capture_locked(int colorbar)
{
	int rc;

	if (!sdram_is_up())
		return CAM_ERR_STATE;

	if (cam_stream_active)
		return CAM_ERR_STATE;   /* streaming owns the DCMI/DMA (issue #46) */

	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}

	rc = camera_configure_locked(colorbar);
	if (rc != 0)
		return rc;

	info.frame_valid = 0;
	drain_done();
	cam_xfer_err    = 0;
	cam_xfer_active = 1;

	/* Re-arm the error interrupts: HAL_DCMI_Init enabled LINE/VSYNC/ERR/OVR
	   once, but the snapshot FRAME ISR disables them all
	   (stm32f7xx_hal_dcmi.c FRAME handling), and HAL_DCMI_Start_DMA does not
	   re-enable them -- without this, an overrun/sync error on the second and
	   later captures would surface as a timeout instead of CAM_ERR_HAL.
	   LINE/VSYNC stay off (nothing consumes them; they fire per line/frame).
	   Clear stale flags first so an old latched error cannot trip the ISR
	   the moment the interrupt enables. */
	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);
	/* JPEG is a variable-length frame: the DMA never completes (the budget
	   exceeds the stream), so the DMA-complete path that arms the FRAME
	   interrupt for a raster snapshot never runs.  Enable FRAME explicitly so the
	   hardware end-of-frame (RM0385 17.4) still wakes us. */
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR |
	                             (mode.is_jpeg ? DCMI_IT_FRAME : 0u));

	/* One contiguous transfer of mode.frame_words.  QVGA = 38400 words runs a
	   plain single DMA; VGA/WVGA exceed 65535 words and HAL_DCMI_Start_DMA
	   transparently bands them (intra-frame DBM into this one buffer), firing
	   FRAME once at the end either way.  No cache maintenance -- cam_frame is in
	   the MPU non-cacheable SDRAM. */
	if (HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)cam_frame,
	                       mode.frame_words) != HAL_OK) {
		cam_xfer_active = 0;
		(void)HAL_DCMI_Stop(&hdcmi);
		drain_done();
		LOG_ERR("DCMI start failed (err 0x%lx)",
		        (unsigned long)HAL_DCMI_GetError(&hdcmi));
		return CAM_ERR_HAL;
	}

	/* The banded (>64 KB) path goes through HAL_DMAEx_MultiBufferStart_IT, which
	   -- unlike the single-transfer HAL_DMA_Start_IT -- enables the DMA FIFO/direct
	   -mode error interrupts.  Under SDRAM contention these FE/DME fire and HAL's
	   DCMI_DMAError aborts the whole snapshot, so VGA/WVGA captures spuriously fail
	   with CAM_ERR_HAL.  Per RM0385 8.5.5 FE/DME do NOT stop the stream, so silence
	   them; a real transfer error (TE) and the DCMI overrun/sync error (DCMI_IT_OVR
	   /ERR) stay terminal.  Harmless on the single-transfer path: FE is off there,
	   and DME (enabled by HAL_DMA_Start_IT too) is benign to silence for a snapshot. */
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_FE);
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_DME);

	if (tx_semaphore_get(&cam_done, CAM_XFER_TIMEOUT_TICKS) != TX_SUCCESS) {
		cam_xfer_active = 0;
		(void)HAL_DCMI_Stop(&hdcmi);
		snapshot_dma_reinit();   /* clear any stale banding DBM/CT */
		drain_done();
		LOG_ERR("frame timed out (no DCMI sync? check wiring)");
		return CAM_ERR_TIMEOUT;
	}
	cam_xfer_active = 0;

	if (cam_xfer_err) {
		(void)HAL_DCMI_Stop(&hdcmi);
		snapshot_dma_reinit();   /* clear any stale banding DBM/CT */
		drain_done();
		LOG_ERR("capture error (HAL err 0x%lx)",
		        (unsigned long)HAL_DCMI_GetError(&hdcmi));
		return CAM_ERR_HAL;
	}

	/* Snapshot auto-cleared CAPTURE; Stop also disables the DCMI, aborts the DMA
	   and leaves the HAL in a clean READY state for the next capture. */
	(void)HAL_DCMI_Stop(&hdcmi);

	if (mode.is_jpeg) {
		/* The DMA was aborted mid-stream by Stop; NDTR holds the untransferred
		   word count, so (budget - NDTR) words were written.  Read it AFTER Stop
		   (not before -- the abort flushes the FIFO and settles NDTR), then trim
		   to the JPEG EOI. */
		uint32_t ndtr = __HAL_DMA_GET_COUNTER(&hdma_dcmi);
		uint32_t eff  = (mode.frame_words - ndtr) * 4u;

