owhinata/stm32f746g-disco/port/camera/camera.c
		rc = jpeg_finalize_locked(eff);
		if (rc != 0) {
			info.frame_valid = 0;
			return rc;
		}
	} else {
		info.frame_bytes = mode.frame_bytes;   /* raster: full frame valid */
	}
	cam_frame_gen++;        /* new pixels: multi-call readers must notice */
	info.frame_valid = 1;
	return 0;
}

/* ---- public API ----------------------------------------------------------- */

int camera_capture(int colorbar)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	rc = camera_capture_locked(colorbar != 0);
	op_unlock();
	return rc;
}

int camera_set_format(enum camera_res res, enum camera_format fmt)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	rc = camera_set_format_locked((uint8_t)res, (uint8_t)fmt);
	op_unlock();
	return rc;
}

int camera_frame_read(uint32_t offset, void *dst, uint32_t len,
                      uint32_t *gen)
{
	int rc;

	if (dst == NULL || len == 0u)
		return CAM_ERR_PARAM;

	rc = op_lock();
	if (rc != 0)
		return rc;
	if (!info.frame_valid) {
		op_unlock();
		return CAM_ERR_NO_FRAME;
	}
	/* Bound against the captured frame's valid length under the lock: the live
	   mode (hence the valid byte count, and for JPEG the trimmed stream length)
	   can change between captures.  Subtraction form so offset+len cannot wrap. */
	if (offset >= info.frame_bytes ||
	    len > info.frame_bytes - offset) {
		op_unlock();
		return CAM_ERR_PARAM;
	}
	memcpy(dst, (const uint8_t *)cam_frame + offset, len);
	if (gen != NULL)
		*gen = cam_frame_gen;
	op_unlock();
	return 0;
}

void camera_frame_invalidate(void)
{
	if (op_lock() != 0)
		return;
	info.frame_valid = 0;
	op_unlock();
}

int camera_streaming(void)
{
	return cam_stream_active;   /* volatile; a destructive .sdram op must refuse */
}

int camera_probe(uint32_t *chip_id)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* streaming owns the sensor/DCMI (#46) */
		op_unlock();
		return CAM_ERR_STATE;
	}
	rc = camera_probe_locked(chip_id);
	op_unlock();
	return rc;
}

int camera_power_off(void)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* cutting power mid-stream wrecks the HW */
		op_unlock();
		return CAM_ERR_STATE;
	}
	power_off_locked();
	op_unlock();
	return 0;
}

int camera_get_info(struct camera_info *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = info;
	op_unlock();
	return 0;
}

int camera_get_mode(struct camera_mode *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = mode;
	op_unlock();
	return 0;
}

/* ---- quality settings public API (issue #44) ----------------------------- */

int camera_get_settings(struct camera_settings *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = settings;
	op_unlock();
	return 0;
}

/* Shared tail for every level setter: takes the mutex, stashes the validated
   value (already range-checked) and re-applies if the sensor is live.
   @field points into `settings`. */
static int set_level(int8_t *field, int value)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	*field = (int8_t)value;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_brightness(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.brightness, level);
}

int camera_set_contrast(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.contrast, level);
}

int camera_set_saturation(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.saturation, level);
}

int camera_set_hue(int degrees)
{
	if (degrees < CAM_HUE_MIN * 30 || degrees > CAM_HUE_MAX * 30 ||
	    (degrees % 30) != 0)
		return CAM_ERR_PARAM;
	return set_level(&settings.hue, degrees / 30);
}

int camera_set_awb(enum camera_awb mode)
{
	int rc;

	if ((unsigned)mode > CAM_AWB_CLOUDY)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.awb = (uint8_t)mode;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_effect(enum camera_effect effect)
{
	int rc;

	if ((unsigned)effect > CAM_FX_GREEN)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.effect = (uint8_t)effect;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_flip(enum camera_flip flip)
{
	int rc;

	if ((unsigned)flip > CAM_FLIP_BOTH)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.flip = (uint8_t)flip;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_zoom(int factor)
{
	int rc;

	if (factor != 1 && factor != 2 && factor != 4 && factor != 8)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.zoom = (uint8_t)factor;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_night(int on)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	settings.night = on ? 1u : 0u;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_defaults(void)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	settings.brightness = 0;
	settings.contrast   = 0;
	settings.saturation = 0;
	settings.hue        = 0;
	settings.awb        = CAM_AWB_AUTO;
	settings.effect     = CAM_FX_NONE;
	settings.flip       = CAM_FLIP_NONE;
	settings.zoom       = 1;
	settings.night      = 0;
	settings_dirty      = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

/* ---- streaming producer (issue #46) -------------------------------------- */

/* frame_os: the pipeline core's injected mutual exclusion (a TX_MUTEX, distinct
   from the driver cam_lock).  The core is only ever entered from the producer
   thread (and start/stats under cam_lock), never from an ISR. */
static void cam_pipe_os_lock(void *ctx)
{
	(void)ctx;
	(void)tx_mutex_get(&cam_pipe_lock, TX_WAIT_FOREVER);
}

static void cam_pipe_os_unlock(void *ctx)
{
	(void)ctx;
	(void)tx_mutex_put(&cam_pipe_lock);
}

