owhinata/stm32f746g-disco/port/camera/camera.c
static const struct frame_os cam_pipe_os = {
	NULL, cam_pipe_os_lock, cam_pipe_os_unlock
};

/* Counting sink: the display-independent FPS / throughput consumer.  DROP
   policy and it returns each frame's pin immediately (no holding), so the
   producer is never blocked -- exactly the #46 measurement target.  The core
   keeps delivered/dropped. */
static int cam_stat_open(void *ctx, enum frame_format fmt, uint16_t w, uint16_t h)
{
	(void)ctx;
	(void)fmt;
	(void)w;
	(void)h;
	return 0;   /* counting sink: accepts whatever the producer publishes (#45) */
}

static int cam_stat_consume(void *ctx, const struct frame_desc *f)
{
	(void)ctx;
	frame_pipeline_put(&cam_pipe, &cam_stat_sink, f);
	return 0;
}

/* DMA transfer-complete (ISR context): one ring buffer just filled.  Only wakes
   the producer; it touches no ring / pipeline / CT state (the #47 ISR rule). */
static void cam_stream_dma_cb(DMA_HandleTypeDef *h)
{
	(void)h;
	if (!cam_stream_active)
		return;
	(void)tx_semaphore_put(&cam_stream_sem);
}

/* DMA error callback.  The double-buffer arm (HAL_DMAEx_MultiBufferStart_IT)
   enables the FIFO-error interrupt the snapshot path (HAL_DMA_Start_IT) leaves
   off.  FE (FIFO) and DME (direct-mode) errors are transient under SDRAM
   contention (LTDC continuously reads the framebuffer) and, per RM0385 8.5.5,
   do NOT disable the stream -- the snapshot path simply never sees them.  So
   count and ignore them (cam_stream_fe); only a transfer error (TE), which the
   hardware uses to actually halt the stream, is terminal (#56). */
static void cam_stream_dma_err_cb(DMA_HandleTypeDef *h)
{
	if (!cam_stream_active)
		return;
	if (!(h->ErrorCode & HAL_DMA_ERROR_TE)) {
		cam_stream_fe++;                    /* FE/DME: non-fatal, keep streaming */
		/* HAL clears the FE/DME flags but not h->ErrorCode; clear the tolerated
		   bits ourselves so HAL_DMA_IRQHandler does not re-enter this callback on
		   every following (TC) interrupt while ErrorCode stays nonzero. */
		h->ErrorCode &= ~(HAL_DMA_ERROR_FE | HAL_DMA_ERROR_DME);
		return;
	}
	cam_stream_err = 1;
	(void)tx_semaphore_put(&cam_stream_sem);
}

static void drain_stream_sem(void)
{
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		;
	/* A start kick that landed while the producer was already active lingers on
	   cam_start_sem; clear it so a later idle wait blocks instead of spinning
	   once. */
	while (tx_semaphore_get(&cam_start_sem, TX_NO_WAIT) == TX_SUCCESS)
		;
}

static uint32_t cam_elapsed_ms;   /* frozen at teardown for post-stop `stats` */

/* Stop the stream and restore a clean snapshot-ready DCMI/DMA.  Producer-thread
   only (single owner): start / stop / auto-stop / OVR all converge here, so the
   HW teardown never races the producer's repoint.  Short cam_lock for the state
   transition (serialises with start / stats). */
static void cam_stream_teardown(void)
{
	(void)tx_mutex_get(&cam_lock, TX_WAIT_FOREVER);
	if (cam_stream_active) {
		cam_stream_active = 0;
		cam_elapsed_ms = HAL_GetTick() - cam_start_tick;
		(void)HAL_DCMI_Stop(&hdcmi);          /* aborts the DMA internally */
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		/* Async stop (OVR/DMA error/auto-stop) while a GUIX preview owns the
		   stream: detach its sink too and release ownership, so the next
		   frame_pipeline_init() (a later start) cannot memset a still-linked
		   sink.  The GUIX sink is synchronous (no cross-thread pin) and its
		   close() is a no-op, so a producer-thread detach is safe here. */
		if (cam_ext_sink != NULL) {
			(void)frame_pipeline_detach(&cam_pipe, cam_ext_sink);
			cam_ext_sink = NULL;
		}
		drain_stream_sem();
		/* HAL_DCMI_Stop leaves CR.DBM set on the stream; re-init the DMA so the
		   next snapshot's HAL_DCMI_Start_DMA runs a plain single transfer. */
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		hdma_dcmi.Init.Mode = DMA_NORMAL;
		(void)HAL_DMA_Init(&hdma_dcmi);
		__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
		LOG_INF("stream stop (%lu frames, ovr dcmi=%lu ring=%lu fe=%lu)",
		        (unsigned long)cam_pipe.stats.published,
		        (unsigned long)cam_stream_ovr, (unsigned long)cam_ring_ovr,
		        (unsigned long)cam_stream_fe);
	}
	(void)tx_mutex_put(&cam_lock);
}

/* Service one completed frame: find the completed buffer via CT, secure a free
   slot, repoint the completed M-register away, THEN publish.  This ordering
   keeps a published slot off the live DMA target list, so a sink never reads a
   buffer the DMA is about to overwrite (tear-free).  No free slot -> drop. */
static void cam_stream_service(int had_sem)
{
	uint32_t ct, seen, extra = 0;
	struct frame_desc *done, *freed;
	int published = 0;

	/* Stop conditions (also handles the bounded-timeout wake with no frame). */
	if (cam_stop_req || cam_stream_err ||
	    (cam_target_frames && cam_pipe.stats.published >= cam_target_frames) ||
	    (cam_target_secs &&
	     (HAL_GetTick() - cam_start_tick) >= cam_target_secs * 1000u)) {
		cam_stream_teardown();
		return;
	}

	/* Completions observed this pass (one semaphore each): the wake plus any
	   drained extras.  We publish at most the most-recent buffer flip; every
	   other observed completion was overwritten -> ring overrun. */
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		extra++;
	seen = (had_sem ? 1u : 0u) + extra;

	ct = (DMA2_Stream1->CR & DMA_SxCR_CT) ? 1u : 0u;
	if (ct != cam_last_ct) {
		cam_last_ct = ct;
		/* CT==1 -> M0 just completed; CT==0 -> M1 just completed (the HAL
		   HAL_DMA_IRQHandler DBM dispatch mirrors this). */
		done = ct ? cam_m0 : cam_m1;
		freed = frame_pipeline_acquire(&cam_pipe);
		if (freed != NULL) {
			if (ct) {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY0);
				cam_m0 = freed;
			} else {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY1);
				cam_m1 = freed;
			}
			frame_pipeline_publish(&cam_pipe, done, mode.frame_bytes,
			                       fmt_to_frame(mode.format), mode.width,
			                       mode.height,
			                       (uint16_t)(mode.width *
			                                  mode.bytes_per_pixel));
			published = 1;
		}
		/* freed == NULL: no free slot, drop (do not publish); the M-reg keeps
		   pointing at `done`, so the DMA simply refills it next cycle. */
	}
	if (seen > (uint32_t)published)
		cam_ring_ovr += seen - (uint32_t)published;
}

