owhinata/stm32f746g-disco/port/camera/camera.c
/* Dedicated producer (priority 10).  When no stream is running it sleeps
   indefinitely (0 CPU) on the start semaphore; while active it bounded-waits on
   the completion semaphore so --secs / stop / OVR fire even if frames stop
   arriving.  The two signals are SEPARATE semaphores on purpose: the start
   wakeup must never be consumed by the active bounded wait (it would be
   miscounted as a frame completion -> a spurious ring overrun). */
static void cam_producer_entry(ULONG arg)
{
	(void)arg;
	for (;;) {
		if (!cam_stream_active) {
			(void)tx_semaphore_get(&cam_start_sem, TX_WAIT_FOREVER);
			continue;
		}
		UINT got = tx_semaphore_get(&cam_stream_sem, CAM_PRODUCER_TICK);

		cam_stream_service(got == TX_SUCCESS);
	}
}

/* Start streaming with the ring/pipeline built fresh, attaching the counting
   sink plus an optional external sink @p ext (GUIX live preview, #56).  cam_lock
   MUST be held; returns 0 or CAM_ERR_* and NEVER unlocks (the public wrappers
   own the lock).  On success ownership of @p ext is recorded in cam_ext_sink
   (NULL for a plain `camera stream`). */
static int stream_start_locked(int colorbar, uint32_t frames, uint32_t secs,
                               struct frame_sink *ext)
{
	int rc;

	if (cam_stream_active)
		return CAM_ERR_STATE;          /* already streaming */
	if (!sdram_is_up())
		return CAM_ERR_STATE;
	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}
	/* A streamed frame must fit one DMA NDTR (frame_words <= 65535) and one ring
	   slot; bigger modes and JPEG are snapshot-only (mode.streamable is 0).  The
	   ring backing is fixed at CAM_RING_N * CAM_RING_SLOT_CAP, so re-check the
	   slot bound here -- frame_pipeline_publish() does not validate bytes <=
	   slot_size (#45). */
	if (!mode.streamable)
		return CAM_ERR_STATE;
	if (mode.frame_bytes > CAM_RING_SLOT_CAP ||
	    (uint32_t)CAM_RING_N * mode.frame_bytes > sizeof cam_ring)
		return CAM_ERR_STATE;

	rc = camera_configure_locked(colorbar != 0);
	if (rc != 0)
		return rc;

	/* Build the ring + pipeline fresh and attach the counting sink (+ ext).
	   slot_size is the ring slot STRIDE (CAM_RING_SLOT_CAP), not the frame
	   length -- the DMA writes mode.frame_bytes into each slot's prefix and
	   publish() stamps that as the valid length. */
	if (frame_pipeline_init(&cam_pipe, &cam_pipe_os, cam_ring,
	                        CAM_RING_SLOT_CAP, CAM_RING_N) != 0)
		return CAM_ERR_STATE;
	frame_pipeline_set_format(&cam_pipe, fmt_to_frame(mode.format),
	                          mode.width, mode.height);
	if (frame_pipeline_attach(&cam_pipe, &cam_stat_sink) != 0)
		return CAM_ERR_STATE;
	if (ext != NULL && frame_pipeline_attach(&cam_pipe, ext) != 0) {
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		return CAM_ERR_STATE;
	}
	cam_m0 = frame_pipeline_acquire(&cam_pipe);
	cam_m1 = frame_pipeline_acquire(&cam_pipe);
	if (cam_m0 == NULL || cam_m1 == NULL) {
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		return CAM_ERR_STATE;
	}

	cam_stream_ovr    = 0;
	cam_ring_ovr      = 0;
	cam_stream_fe     = 0;
	cam_stream_err    = 0;
	cam_stop_req      = 0;
	cam_last_ct       = 0;
	cam_elapsed_ms    = 0;
	cam_start_tick    = HAL_GetTick();
	cam_target_frames = frames;
	cam_target_secs   = secs;
	drain_stream_sem();

	/* Manual DBM start (the HAL's own >64KB path is intra-frame banding, not
	   inter-frame double buffering).  Order: callbacks -> DMA DBM start ->
	   DCMI CM=0 (continuous, before enable) -> enable -> ERR/OVR IT -> CAPTURE. */
	hdma_dcmi.XferCpltCallback   = cam_stream_dma_cb;
	hdma_dcmi.XferM1CpltCallback = cam_stream_dma_cb;
	hdma_dcmi.XferErrorCallback  = cam_stream_dma_err_cb;
	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);

	cam_stream_active = 1;             /* arm the ISR + producer */
	if (HAL_DMAEx_MultiBufferStart_IT(&hdma_dcmi,
	        (uint32_t)&hdcmi.Instance->DR,
	        (uint32_t)cam_m0->data, (uint32_t)cam_m1->data,
	        mode.frame_words) != HAL_OK) {
		cam_stream_active = 0;
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		LOG_ERR("stream DMA start failed");
		return CAM_ERR_HAL;
	}
	hdcmi.Instance->CR &= ~DCMI_CR_CM;            /* continuous */
	__HAL_DCMI_ENABLE(&hdcmi);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR);
	hdcmi.Instance->CR |= DCMI_CR_CAPTURE;
	hdcmi.State = HAL_DCMI_STATE_BUSY;

	cam_ext_sink = ext;               /* record preview ownership (NULL = plain) */

	/* Wake the producer out of its idle FOREVER wait on the dedicated start
	   semaphore -- never the completion semaphore, so it cannot be miscounted. */
	(void)tx_semaphore_put(&cam_start_sem);
	LOG_INF("stream start (frames=%lu secs=%lu%s)",
	        (unsigned long)frames, (unsigned long)secs,
	        ext ? ", gui preview" : "");
	return 0;
}

int camera_stream_start(int colorbar, uint32_t frames, uint32_t secs)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	if (cam_ext_sink != NULL) {        /* owned by the GUIX live preview (#56) */
		op_unlock();
		return CAM_ERR_STATE;
	}
	rc = stream_start_locked(colorbar, frames, secs, NULL);
	op_unlock();
	return rc;
}

int camera_preview_start(struct frame_sink *s)
{
	int rc;

	if (s == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* Preview forces QVGA RGB565 (the #56 GUIX sink's only accepted geometry)
	   regardless of the last `camera res/format`.  Same lock: call the locked
	   helper, never the public camera_set_format (which would re-take cam_lock).
	   The set_format gate passes because no stream/preview owns the DCMI yet. */
	rc = camera_set_format_locked(CAM_RES_QVGA, CAM_FMT_RGB565);
	if (rc == 0)
		rc = stream_start_locked(0, 0, 0, s);
	op_unlock();
	return rc;
}

int camera_preview_stop(struct frame_sink *s)
{
	int inflight = 0;

