owhinata/stm32f746g-disco/port/camera/camera.c
	/* DCMI: 8-bit, hardware sync, the H747I BSP's proven OV5640 polarities
	   (OV5640_Init programs the matching sensor side). */
	hdcmi.Instance               = DCMI;
	hdcmi.Init.SynchroMode       = DCMI_SYNCHRO_HARDWARE;
	hdcmi.Init.PCKPolarity       = DCMI_PCKPOLARITY_RISING;
	hdcmi.Init.VSPolarity        = DCMI_VSPOLARITY_HIGH;
	hdcmi.Init.HSPolarity        = DCMI_HSPOLARITY_HIGH;
	hdcmi.Init.CaptureRate       = DCMI_CR_ALL_FRAME;
	hdcmi.Init.ExtendedDataMode  = DCMI_EXTEND_DATA_8B;
	hdcmi.Init.JPEGMode          = DCMI_JPEG_DISABLE;
	if (HAL_DCMI_Init(&hdcmi) != HAL_OK) {
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		LOG_ERR("DCMI init failed");
		goto fail_i2c;
	}

	/* NVIC: below USART1 (5) / SDMMC1 (6) / SD DMA (7), above SysTick (14).
	   The ThreadX port masks with PRIMASK, so tx_semaphore_put from these
	   ISRs is safe whatever the numeric priority. */
	HAL_NVIC_SetPriority(DCMI_IRQn, 8, 0);
	HAL_NVIC_EnableIRQ(DCMI_IRQn);
	HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, 8, 0);
	HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

	/* Bind the component driver to this bus once; Address is the 8-bit
	   write address the HAL Mem API expects. */
	io.Init      = cam_io_init;
	io.DeInit    = cam_io_deinit;
	io.Address   = CAM_I2C_ADDR;
	io.WriteReg  = cam_io_write;
	io.ReadReg   = cam_io_read;
	io.ModifyReg = NULL;
	io.GetTick   = cam_io_gettick;
	if (OV5640_RegisterBusIO(&ov5640, &io) != OV5640_OK) {
		(void)HAL_DCMI_DeInit(&hdcmi);
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		LOG_ERR("OV5640 bus registration failed");
		goto fail_i2c;
	}

	/* The streaming counting sink (issue #46) -- format-validated at attach. */
	cam_stat_sink.name    = "stats";
	cam_stat_sink.ctx     = NULL;
	cam_stat_sink.policy  = FRAME_POLICY_DROP;
	cam_stat_sink.open    = cam_stat_open;
	cam_stat_sink.consume = cam_stat_consume;
	cam_stat_sink.close   = NULL;

	/* Dedicated producer thread: idles until a stream starts. */
	if (tx_thread_create(&cam_producer, "cam_prod", cam_producer_entry, 0,
	                     cam_producer_stack, sizeof cam_producer_stack,
	                     CAM_PRODUCER_PRIO, CAM_PRODUCER_PRIO,
	                     TX_NO_TIME_SLICE, TX_AUTO_START) != TX_SUCCESS) {
		(void)HAL_DCMI_DeInit(&hdcmi);
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		LOG_ERR("camera producer thread create failed");
		goto fail_i2c;
	}

	mode_recompute(&mode);    /* fill geometry/derived fields for the default */

	cam_ready = 1;
	LOG_INF("I2C1 + DCMI/DMA2-S1 up; sensor I/O is lazy");
	return 0;

fail_i2c:
	(void)HAL_I2C_DeInit(&hcam_i2c);
fail:
	tx_semaphore_delete(&cam_start_sem);
	tx_semaphore_delete(&cam_stream_sem);
	tx_mutex_delete(&cam_pipe_lock);
	tx_semaphore_delete(&cam_done);
	tx_mutex_delete(&cam_lock);
	return CAM_ERR_HAL;
}

/* ---- ISRs + HAL completion callbacks ------------------------------------- */
/*
 * Strong overrides of the CMSIS weak vectors, wrapped in the ThreadX
 * execution-profile enter/exit exactly like the SD driver's (sd_card.c):
 * these only fire during a capture, which is started from a shell thread
 * long after the profile kit is armed.
 */
void DCMI_IRQHandler(void)
{
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_enter(); __set_PRIMASK(pm); }
#endif
	HAL_DCMI_IRQHandler(&hdcmi);
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_exit(); __set_PRIMASK(pm); }
#endif
}

void DMA2_Stream1_IRQHandler(void)
{
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_enter(); __set_PRIMASK(pm); }
#endif
	HAL_DMA_IRQHandler(&hdma_dcmi);
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_exit(); __set_PRIMASK(pm); }
#endif
}

/* Frame complete: the DMA finished the frame's words (DCMI_DMAXferCplt armed
   the FRAME interrupt) and the DCMI saw the frame end.  Posted only while a
   capture is in flight; a late post after a timeout/stop is suppressed by
   the cam_xfer_active gate and removed by the next drain. */
void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *h)
{
	(void)h;
	if (!cam_xfer_active)
		return;
	(void)tx_semaphore_put(&cam_done);
}

/* Sync error, overrun and DMA errors all funnel here via the HAL. */
void HAL_DCMI_ErrorCallback(DCMI_HandleTypeDef *h)
{
	(void)h;
	/* Streaming (issue #46): a continuous-mode DCMI overrun is terminal -- the
	   HAL DCMI IRQ has already aborted the DMA -- so flag it and wake the
	   producer to tear down cleanly.  (Mode-exclusive with the snapshot gate.) */
	if (cam_stream_active) {
		cam_stream_err = 1;
		cam_stream_ovr++;
		(void)tx_semaphore_put(&cam_stream_sem);
		return;
	}
	if (!cam_xfer_active)
		return;
	cam_xfer_err = 1;
	(void)tx_semaphore_put(&cam_done);
}
